src/DataProcessors/ЗаказПоПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаказПоПочте</Name>
			<Comment>Обработка подключается в почтовому серверу, читает письма-заказы на почтовом ящике и загружает их в 1С</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ДанныеПочтыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПочтыЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресСервераIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьSSLIMAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соискатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заявитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобственности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобственностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСчетаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗаказПоПочте/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьПарольПочты(Команда)
	ОткрытьФорму("Обработка.ЗаказПоПочте.Форма.ФормаДляВводаПароля");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеПочтовогоСервера(Команда)
	ОткрытьФорму("РегистрСведений.ДанныеПочтыЗаявок.Форма.ФормаСписка",,,,,,,);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПочту(Команда)
	ПолучитьПочтуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПочтуНаСервере()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДанныеПочтыЗаявок.АдресСервераIMAP КАК АдресСервераIMAP,
		|	ДанныеПочтыЗаявок.ПользовательIMAP КАК ПользовательIMAP,
		|	ДанныеПочтыЗаявок.ПортIMAP КАК ПортIMAP,
		|	ДанныеПочтыЗаявок.ИспользоватьSSLIMAP КАК ИспользоватьSSLIMAP
		|ИЗ
		|	РегистрСведений.ДанныеПочтыЗаявок КАК ДанныеПочтыЗаявок";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		АдресСервераIMAP = Выборка.АдресСервераIMAP;
		ПользовательIMAP = Выборка.ПользовательIMAP; 
		ПортIMAP = Выборка.ПортIMAP;
		ИспользоватьSSLIMAP = Выборка.ИспользоватьSSLIMAP;
	КонецЦикла;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераIMAP = АдресСервераIMAP;
	Профиль.ПользовательIMAP = ПользовательIMAP;
	Хранилище = Константы.ПарольIMAP.Получить();
	Если Хранилище = Неопределено Тогда
		Сообщить("Не задан пароль IMAP! Сохраните его через форму настройки.");
		Возврат;
	КонецЕсли;
	Профиль.ПарольIMAP = Хранилище.Получить();
	Профиль.ПортIMAP = ПортIMAP;
	Профиль.ИспользоватьSSLIMAP = ИспользоватьSSLIMAP;
	
	Попытка
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);
		Сообщить("Есть подключение к почте!");
		
		// Серверный фильтр: непрочитанные + тема содержит "Заявка сайт"
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Прочитанные", Ложь);
		ПараметрыОтбора.Вставить("Тема", "Заявка сайт");
		
		Заголовки = Почта.ПолучитьЗаголовки(ПараметрыОтбора);
		
		Если Заголовки.Количество() = 0 Тогда
			Сообщить("Непрочитанных писем с «Заявка сайт» нет");
			Почта.Отключиться();
			Возврат;
		КонецЕсли;
		
		Сообщить("Сервер отдал заголовков: " + Заголовки.Количество());
		
		// Скачиваем только эти письма (не все непрочитанные!)
		МассивПисем = Почта.Выбрать(Ложь, Заголовки, Истина);
		
		СчётчикЗаявок = 0;
		Для Каждого Письмо Из МассивПисем Цикл    
						
			// У ИнтернетПочтовоСообщение .Тема доступна всегда
			ТемаПисьма = СокрЛП(Письмо.Тема);
			Сообщить(">ТЕМА: >" + ТемаПисьма + "<");
			
			// Точный фильтр: ровно «Заявка сайт»
			Если ВРег(ТемаПисьма) = "ЗАЯВКА САЙТ" Тогда
				СчётчикЗаявок = СчётчикЗаявок + 1;
				Сообщить("========================================");
				Сообщить("От: " + Письмо.Отправитель.Адрес);
				Сообщить("Тема: " + Письмо.Тема);
				Сообщить("Дата: " + Письмо.ДатаОтправления);
				Сообщить("========================================");
			КонецЕсли;  
			
			// --- Основная логика обработки заявки ---
			ДанныеЗаявки = ПолучитьДанныеИзЗаявки(Письмо.Тексты[0].Текст); // берём первый HTML-текст
			
			Если ДанныеЗаявки.Имя = "" Тогда
				Сообщить("Не удалось извлечь Имя из письма — пропускаем заявку.");
				Возврат;
			КонецЕсли;
			
			// Поиск контрагента по телефону (лучше всего для заявок с форм)
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|   Контрагенты.Ссылка КАК Ссылка,
			|   Контрагенты.Телефон КАК Телефон,
			|   Контрагенты.Email КАК Email
			|ИЗ
			|   Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|   Контрагенты.Телефон = &Телефон";
			Запрос.УстановитьПараметр("Телефон", ДанныеЗаявки.Телефон);
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				СсылкаКонтрагента = Результат.Ссылка;
			Иначе
				// Создаём нового контрагента
				НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				НовыйКонтрагент.Наименование = ДанныеЗаявки.Имя;
				НовыйКонтрагент.Телефон = ДанныеЗаявки.Телефон;
				НовыйКонтрагент.Email = ДанныеЗаявки.Email;  
				НовыйКонтрагент.Комментарий = ДанныеЗаявки.Комментарий;
				
				// ТипКонтрагента: Соискатель
				НовыйКонтрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Соискатель;
				
				// Родитель: группа «Соискатели» (если предопределённая, иначе ищи по наименованию)
				Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Соискатели");
				Если Родитель = Справочники.Контрагенты.ПустаяСсылка() Тогда
					// Если группы нет — можно либо создать, либо оставить без родителя.
					// Здесь просто оставляем без родителя, но лучше один раз создать группу вручную.
					Сообщить("Группа «Соискатели» не найдена — контрагент создан без родителя.");
				Иначе
					НовыйКонтрагент.Родитель = Родитель;
				КонецЕсли;
				
				Попытка
					НовыйКонтрагент.Записать();
					СсылкаКонтрагента = НовыйКонтрагент.Ссылка;
					Сообщить("Создан контрагент: " + НовыйКонтрагент.Наименование);
				Исключение
					Сообщить("Ошибка записи контрагента: " + ОписаниеОшибки());
					Возврат;
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СчётчикЗаявок = 0 Тогда
			Сообщить("Заявок с точной темой «Заявка сайт» не найдено");
		Иначе
			Сообщить("Обработано заявок: " + СчётчикЗаявок);
		КонецЕсли;
		
		Почта.Отключиться();
	Исключение
		Сообщить("Ошибка получения почты: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеИзЗаявки(ТекстПисьма)
	Данные = Новый Структура;
	Данные.Вставить("Имя", "");
	Данные.Вставить("Email", "");
	Данные.Вставить("Телефон", "");
	Данные.Вставить("Комментарий", "");
	
	// Имя
	ПозИмя = Найти(ТекстПисьма, "Имя: ");
	Если ПозИмя > 0 Тогда
		Подстрока = Сред(ТекстПисьма, ПозИмя + 5);
		ПозКонец = Найти(Подстрока, "<");
		Если ПозКонец > 0 Тогда
			Данные.Имя = СокрЛП(Лев(Подстрока, ПозКонец - 1));
		КонецЕсли;
	КонецЕсли;
	
	// Email
	ПозEmail = Найти(ТекстПисьма, "E-mail: ");
	Если ПозEmail > 0 Тогда
		Подстрока = Сред(ТекстПисьма, ПозEmail + 8);
		ПозКонец = Найти(Подстрока, "<");
		Если ПозКонец > 0 Тогда
			Данные.Email = СокрЛП(Лев(Подстрока, ПозКонец - 1));
		КонецЕсли;
	КонецЕсли;
	
	// Телефон
	ПозТелефон = Найти(ТекстПисьма, "Телефон: ");
	Если ПозТелефон > 0 Тогда
		Подстрока = "7" + Сред(ТекстПисьма, ПозТелефон + 9);
		ПозКонец = Найти(Подстрока, "<");
		Если ПозКонец > 0 Тогда
			Данные.Телефон = СокрЛП(Лев(Подстрока, ПозКонец - 1));
		КонецЕсли;
	КонецЕсли;
	
	// Комментарий
	ПозКомментарий = Найти(ТекстПисьма, "Комментарий: ");
	Если ПозКомментарий > 0 Тогда
		Подстрока = Сред(ТекстПисьма, ПозКомментарий + 13);
		ПозКонец = Найти(Подстрока, "<");
		Если ПозКонец > 0 Тогда
			Данные.Комментарий = СокрЛП(Лев(Подстрока, ПозКонец - 1));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Данные;
КонецФункции
